import React from "react";
import bg from "../Assets/Img/aboutusbg.png";
import Logo from "../Assets/Svgs/Logo";

export default () => {
  return (
    <div>
      <img
        className="w-screen h-screen object-cover absolute z-[-100]"
        src={bg}
      />
      <div
        dir="rtl"
        className="w-screen h-screen flex justify-center items-center"
      >
        <div className=" flex flex-col  shadow-xl shadow-[#000000d0] h-[90vh] w-[80vw] md:w-[60vw] md:h-[70vh] rounded-xl mt-10 md:mt-0 backdrop-blur-lg bg-[#2e3a3f98]">
          <div className="flex w-full justify-center my-5">
            <Logo color="#fff" />
          </div>
          <p className="overflow-auto px-10 text-justify text-[#c2c2c2] text-[0.8rem] md:text-[1rem]">
            این سایت با هدف میزبانی از هزاران وبلاگ و وبلاگ نویس و ایجاد بستر
            مناسبی برای فعالیت های آنها ایجاد شده است.مدیریت وبلاگ ها علاوه بر
            مسائل تکنیکی نیازمند مسئولیت پذیری بالایی است، چرا که حجم بسیاری از
            مطالب و اطلاعات از سوی کاربران متعدد در سایت سرویس دهنده ها جمع آوری
            می شود که مورد نیاز کاربران است و درحقیقت نمی توان این مساله را به
            عنوان موضوعی آزمایشی و موقت تلقی کرد.شیرازی با اشاره به اینکه تحقق
            این امر نیازمند برنامه ریزی و حامیان مالی است، گفت: برای شکل گیری
            بلاگفا نیاز ... به اسپانسر مالی داشتیم که بعد از توافق با یک شرکت
            معتبر در زمینه هاستینگ فعالیت این سایت آغاز شد. وی، خاطر نشان کرد:
            در زمانی که بلاگفا شروع به کار کرد با کمبود امکانات مواجه نبودیم؛
            بلکه مشکل کیفیت سرویس دهنده ها بود چرا که اکثرکاربران معتقد بودند
            سرویس دهنده های دنیای وب از سرعت بسیار پایینی برخوردار هستند و به
            همین جهت تاکید بسیاری بر روی سرعت و کیفیت سرویس داشتیم که در حال
            حاضر نیز تا حدود زیادی نیازهای مخاطبان خود را در این زمینه رفع کرده
            ایم و در واقع کیفیت و سرعت از ویژگی های منحصر به فرد بلاگفا نسبت به
            سایر سرویس دهنده ها بوده است.
          </p>
        </div>
      </div>
    </div>
  );
};
